export const StampIcon = (): JSX.Element => (
  <svg xmlns="http://www.w3.org/2000/svg" width="16" height="15.264" viewBox="0 0 16 15.264">
    <defs>
      <clipPath id="clip-path">
        <rect id="長方形_3383" data-name="長方形 3383" width="16" height="15.264" fill="#112744" />
      </clipPath>
    </defs>
    <g id="グループ_11960" data-name="グループ 11960" clipPath="url(#clip-path)">
      {/* eslint-disable-next-line max-len */}
      <path id="パス_49579" data-name="パス 49579" d="M.4,14.574h0a.691.691,0,0,1,.691-.691H14.968a.634.634,0,0,1,.634.634v.057a.691.691,0,0,1-.691.691H1.1A.691.691,0,0,1,.4,14.574M15.286,9.819,10.116,9A.849.849,0,0,1,9.4,8.157V5.918a.951.951,0,0,1,.371-.751,2.886,2.886,0,1,0-3.541,0,.985.985,0,0,1,.375.778V8.158A.849.849,0,0,1,5.891,9L.713,9.821a.777.777,0,0,0-.706.833L.29,12.486a.861.861,0,0,0,.892.656H15.112c.449,0,.511-.277.573-.649l.306-1.834a.776.776,0,0,0-.7-.84" transform="translate(0 -0.001)" fill="#112744" />
    </g>
  </svg>

);
